tap "martinpaljak/brew"
brew "openjdk"
brew "ant"
brew "openssl@3"
brew "libpq"
brew "composer"
brew "create-dmg"
brew "bat"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "zoxide"
brew "go"
brew "htop"
brew "jpeg"
brew "julia"
brew "kind"
brew "lua"
brew "luarocks"
brew "neovim"
brew "node"
brew "ocaml"
brew "openjdk@17"
brew "python@3.14"
brew "pipx"
brew "poppler"
brew "pyenv"
brew "python@3.13"
brew "ripgrep"
brew "rust"
brew "stow"
brew "thefuck"
brew "tree"
brew "wakeonlan"
brew "wget"
brew "yubico-piv-tool"
brew "zsh-syntax-highlighting"
brew "martinpaljak/brew/gppro", args: ["HEAD"]
cask "appcleaner"
cask "discord"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "karabiner-elements"
cask "keepassxc"
cask "macdown"
cask "microsoft-edge"
cask "obsidian"
cask "opensc-app"
cask "postman"
cask "pycharm"
cask "steam"
cask "temurin"
cask "visual-studio-code"
cask "windows-app"
cask "zed"
vscode "aflo.desert-vim"
vscode "aflo.kanagawa-glass"
vscode "aflo.rose-prime-v2"
vscode "albert.tabout"
vscode "alefragnani.project-manager"
vscode "alphaq1611.rose-prime-theme"
vscode "andenetalexander.vim-cheatsheet"
vscode "anksio.tsoding-emacs-gruber-minimal"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "berublan.vscode-log-viewer"
vscode "catppuccin.catppuccin-vsc"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "dadroit.dadroit-json-generator"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-yaml"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "illixion.vscode-vibrancy-continued"
vscode "ironmansoftware.powershellprotools"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mads-hartmann.bash-ide-vscode"
vscode "manas.paradise-vscode"
vscode "manitejapratha.cursor-midnight-theme"
vscode "marlon407.code-groovy"
vscode "mateocerquetella.xcode-12-theme"
vscode "maximetinu.identical-sublime-monokai-csharp-theme-colorizer"
vscode "mechatroner.rainbow-csv"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "mvllow.rose-pine"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "nilssoderman.batch-runner"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "noxiz.jinja-snippets"
vscode "ocamllabs.ocaml-platform"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "publictheta.vscode-create-project"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rogalmic.bash-debug"
vscode "rvest.vs-code-prettier-eslint"
vscode "samuelcolvin.jinjahtml"
vscode "sankooc.pcapviewer"
vscode "serpen.vbsvscode"
vscode "sidthesloth.html5-boilerplate"
vscode "simonho.kanagawa-paper"
vscode "stevenkustov.rosetta-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "toba.vsfire"
vscode "tomoki1207.pdf"
vscode "tylerleonhardt.vscode-inline-values-powershell"
vscode "usernamehw.errorlens"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
